
## Plan Result (prod)




<pre><code>Plan: 19 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_HOST
  * module.data-store-db-v11.azurerm_postgresql_active_directory_administrator.admin
  * module.data-store-db-v11.azurerm_resource_group.data-resourcegroup
  * module.data-store-db-v11.azurerm_template_deployment.postgres-paas
  * module.data-store-db-v11.null_resource.set-user-permissions[0]
  * module.data-store-db-v11.null_resource.subnet_mappings[0]
  * module.data-store-db-v11.null_resource.subnet_mappings[1]
  * module.data-store-db-v11.null_resource.subnet_mappings[2]
  * module.data-store-db-v11.null_resource.subnet_mappings[3]
  * module.data-store-db-v11.null_resource.subnet_mappings[4]
  * module.data-store-db-v11.null_resource.subnet_mappings[5]
  * module.data-store-db-v11.null_resource.subnet_mappings[6]
  * module.data-store-db-v11.null_resource.subnet_mappings[7]
  * module.data-store-db-v11.null_resource.subnet_mappings[8]
  * module.data-store-db-v11.null_resource.subnet_mappings[9]
  * module.data-store-db-v11.random_string.password
  * module.postgresql_v15.null_resource.set-schema-ownership[&#34;ccd_data_store&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-shared-prod/providers/Microsoft.KeyVault/vaults/ccd-prod"
      + name                    = "data-store-api-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-shared-prod/providers/Microsoft.KeyVault/vaults/ccd-prod"
      + name                    = "data-store-api-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-shared-prod/providers/Microsoft.KeyVault/vaults/ccd-prod"
      + name                    = "data-store-api-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data-store-db-v11.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-data-store-api-postgres-db-v11-prod"
      + resource_group_name = "ccd-data-store-api-postgres-db-v11-data-prod"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)
    }

  # module.data-store-db-v11.azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations SC"
      + object_id           = "4d0554dd-fe60-424a-be9c-36636826d927"
      + resource_group_name = "ccd-data-store-api-postgres-db-v11-data-prod"
      + server_name         = "ccd-data-store-api-postgres-db-v11-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data-store-db-v11.azurerm_resource_group.data-resourcegroup will be created
  + resource "azurerm_resource_group" "data-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ccd-data-store-api-postgres-db-v11-data-prod"
      + tags     = {
          + "application"         = "core-case-data"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-data-store-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "production"
          + "managedBy"           = "CCD"
        }
    }

  # module.data-store-db-v11.azurerm_template_deployment.postgres-paas will be created
  + resource "azurerm_template_deployment" "postgres-paas" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "ccd-data-store-api-postgres-db-v11-prod"
      + outputs             = (known after apply)
      + parameters          = (known after apply)
      + resource_group_name = "ccd-data-store-api-postgres-db-v11-data-prod"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + administratorLogin         = {
                      + maxLength = 16
                      + minLength = 1
                      + type      = "string"
                    }
                  + administratorLoginPassword = {
                      + type = "securestring"
                    }
                  + backupRetentionDays        = {
                      + defaultValue = 7
                      + type         = "string"
                    }
                  + charset                    = {
                      + type = "string"
                    }
                  + collation                  = {
                      + type = "string"
                    }
                  + commonTags                 = {
                      + type = "string"
                    }
                  + dbName                     = {
                      + type = "string"
                    }
                  + dbRules                    = {
                      + type = "string"
                    }
                  + env                        = {
                      + metadata = {
                          + description = "The tag"
                        }
                      + type     = "string"
                    }
                  + geoRedundantBackup         = {
                      + defaultValue = "Enabled"
                      + type         = "string"
                    }
                  + location                   = {
                      + allowedValues = [
                          + "UK West",
                          + "ukwest",
                          + "UK South",
                          + "uksouth",
                        ]
                      + defaultValue  = "UK South"
                      + type          = "string"
                    }
                  + serverName                 = {
                      + maxLength = 63
                      + minLength = 2
                      + type      = "string"
                    }
                  + skuCapacity                = {
                      + defaultValue = 2
                      + type         = "string"
                    }
                  + skuFamily                  = {
                      + allowedValues = [
                          + "Gen5",
                        ]
                      + defaultValue  = "Gen5"
                      + type          = "string"
                    }
                  + skuName                    = {
                      + allowedValues = [
                          + "B_Gen5_1",
                          + "B_Gen5_2",
                          + "GP_Gen5_2",
                          + "GP_Gen5_4",
                          + "GP_Gen5_8",
                          + "GP_Gen5_16",
                          + "GP_Gen5_32",
                          + "MO_Gen5_2",
                          + "MO_Gen5_4",
                          + "MO_Gen5_8",
                          + "MO_Gen5_16",
                          + "MO_Gen5_32",
                        ]
                      + defaultValue  = "GP_Gen5_2"
                      + type          = "string"
                    }
                  + skuSizeMB                  = {
                      + defaultValue = "51200"
                      + type         = "string"
                    }
                  + skuTier                    = {
                      + allowedValues = [
                          + "Basic",
                          + "GeneralPurpose",
                          + "MemoryOptimized",
                        ]
                      + defaultValue  = "GeneralPurpose"
                      + type          = "string"
                    }
                  + sslEnforcement             = {
                      + defaultValue = "Enabled"
                      + type         = "string"
                    }
                  + version                    = {
                      + allowedValues = [
                          + "9.5",
                          + "9.6",
                          + "10",
                          + "11",
                        ]
                      + defaultValue  = "9.6"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-12-01-preview"
                      + kind       = ""
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('serverName')]"
                      + properties = {
                          + administratorLogin         = "[parameters('administratorLogin')]"
                          + administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          + sslEnforcement             = "[parameters('sslEnforcement')]"
                          + storageProfile             = {
                              + backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              + geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              + storageMB           = "[parameters('skuSizeMB')]"
                            }
                          + version                    = "[parameters('version')]"
                        }
                      + resources  = [
                          + {
                              + apiVersion = "2017-12-01-preview"
                              + dependsOn  = [
                                  + "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              + name       = "[parameters('dbName')]"
                              + properties = {
                                  + charset   = "[parameters('charset')]"
                                  + collation = "[parameters('collation')]"
                                }
                              + type       = "databases"
                            },
                        ]
                      + sku        = {
                          + capacity = "[parameters('skuCapacity')]"
                          + family   = "[parameters('skuFamily')]"
                          + name     = "[parameters('skuName')]"
                          + size     = "[parameters('skuSizeMB')]"
                          + tier     = "[parameters('skuTier')]"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  + {
                      + apiVersion = "2017-12-01-preview"
                      + copy       = {
                          + count = "[length(variables('dbRules'))]"
                          + name  = "storagecopy"
                        }
                      + dependsOn  = [
                          + "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      + location   = "[parameters('location')]"
                      + name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      + properties = {
                          + ignoreMissingVnetServiceEndpoint = true
                          + virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      + type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              + variables      = {
                  + dbRules = "[base64ToJson(parameters('dbRules'))]"
                  + tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.data-store-db-v11.null_resource.set-user-permissions[0] will be created
  + resource "null_resource" "set-user-permissions" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS JIT Access ccd DB Reader SC"
          + "name"           = "ccd-data-store-api-postgres-db-v11"
          + "script_hash"    = "03f79db43eea0260e31fe3dc6925df25b0373bdeb9982b92bedf86dfd47d593a"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[0] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "ase"
          + "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-3-prod"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[1] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "cft-tf-aks00"
          + "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-00"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[2] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "cft-tf-aks01"
          + "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-01"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[3] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jenkins-aks"
          + "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[4] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jenkins-aks-agent"
          + "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[5] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "idam-prod2-vnet"
          + "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2/subnets/core-infra-subnet-7-idam-prod2"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[6] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "bastion-prod-vnet"
          + "subnet_id" = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet/subnets/bastion"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[7] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-prod-aks00"
          + "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-00"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[8] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-prod-aks01"
          + "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-01"
        }
    }

  # module.data-store-db-v11.null_resource.subnet_mappings[9] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-data-gateway-prod"
          + "subnet_id" = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/shared-data-gateway"
        }
    }

  # module.data-store-db-v11.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

  # module.postgresql_v15.null_resource.set-schema-ownership["ccd_data_store"] will be created
  + resource "null_resource" "set-schema-ownership" {
      + id       = (known after apply)
      + triggers = {
          + "force_trigger" = "2"
          + "name"          = "ccd-data-store-api-postgres-db-v15"
          + "script_hash"   = "ab1645969422eb52f19784fd29e26fd044ec09acb082bf6000c500468232933e"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1260,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->